import useEnglishNumbers from 'hooks/useEnglishNumbers';
import BlogsDetailsMainImage from './BlogsDetailsMainImage';
import BlogsDetailsMainNavigation from './BlogsDetailsMainNavigation';
import BlogsDetailsMainComments from './BlogsDetailsMainComments';

const blog = {
  title: 'میدان هیپودروم استانبول',
  short_text:
    'میدان هیپودروم در استانبول ترکیه در زمان امپراتوری بیزانس مرکز اجتماعات، برنامه های ورزشی و سیرک شهر قسطنطنیه (استانبول امروزی) بوده است. میدان هیپودروم در حال حاضر با نام میدان سلطان احمد شناخته می شود و هنوز قطعاتی از آثار بیزانسی در آن موجود است.',
  description:
    '<p dir="RTL" style="text-align:justify">هیپودروم واژه ای یونانی است که از دو بخش هیپو به معنای اسب، و دروم به معنای میدان تشکیل شده است. به همین مناسبت هنوز در ترکیه عده ای آن را آت میدانی (at meydani) می خوانند. مسابقات اسب دوانی و ارابه رانی تفریحات مورد علاقه مردم در دنیای قدیم و در زمان امپراتوری روم و بیزانس بوده است و در بسیاری از شهرهای یونانی و رومی میدانهایی به این منظور ساخته می شده است. گرچه امروز دیگر اثری از ساختار و اساس میدان اسب دوانی هیپودروم باقی نمانده، اما میدان سلطان احمد در استانبول ترکیه، بر اساس ابعاد و نقشه های آن بنا شده و مسیر میدان اسب دوانی هیپودروم، در میدان سلطان احمد استانبول با سنگفرش مشخص شده است. آثار باستانی به جا مانده از هیپودروم، امروز در محوطه سبز میدان سلطان احمد خونمایی می کنند.</p>\r\n\r\n<h2 dir="RTL" style="text-align:justify">موقعیت جغرافیایی هیپودروم استانبول</h2>\r\n\r\n<p dir="RTL" style="text-align:justify">هیپودروم استانبول که امروز با نام میدان سلطان احمد شناخته می شود، در محله سلطان احمد منطقه فاتح بخش اروپایی استانبول ترکیه قرار دارد. هیپودروم در این منطقه با بخش بزرگی از جاذبه های توریستی استانبول، به ویژه دیدنی های تاریخی همسایه است. مسجد سلطان احمد (مسجد کبود)، موزه ایاصوفیا، موزه آثار تاریخی ترکی و اسلامی، کاخ موزه توپکاپی، آب انبار باستانی باسیلیکا سیسترن، بازار بزرگ استانبول، پارک معروف گلخانه، پارک سلطان احمد و... تنها بخشی از همسایگان هیپودروم در منطقه فاتح استانبول هستند. چندین هتل مجلل ۴ و ۵ ستاره و فروشگاه های بسیاری نیز در اطراف این میدان تاریخی دیده می شوند.</p>\r\n\r\n<h2 dir="RTL" style="text-align:justify">&nbsp;<img alt="" src="/media/upload/2022/09/24/8ced188b-6d77-47d8-9bd6-e43af2036968-840x560.jpg" /></h2>\r\n\r\n<h2 dir="RTL" style="text-align:justify">تاریخچه هیپودروم استانبول</h2>\r\n\r\n<p dir="RTL" style="text-align:justify">گرچه بسیاری از مردم هیپودروم را نشانه ای از روزگار اوج قسطنطنیه (استانبول امروزی) به عنوان پایتخت امپراتوری بیزانس می دانند، اما در حقیقت هیپودروم استانبول سالخورده تر از این امپراتوری است. نخستین هیپودروم در استانبول، در سال 203 میلادی در زمانی ساخته شد که این شهر با نام بیزانتیوم شناخته می شد. امپراتور سپیتیموس سرووس در این سال دستور بازسازی و گسترش شهر را داد، و هیپودروم را به عنوان محلی برای مسابقات اسب دوانی و سایر تفریحات وقف آن نمود.</p>\r\n\r\n<p dir="RTL" style="text-align:justify">در سال 324 میلادی امپراتور کنستانتین کبیر تصمیم گرفت که پایتخت امپراتوری خود را از &laquo;رم&raquo; به بیزانتیوم (استانبول امروزی) منتقل کند، و نام شهر را &laquo;رم جدید&raquo; بگذارد. گرچه این نامگذاری دیری نپایید و همه این شهر را با نام قسطنطنیه (کنستانتینوپل؛ شهر کنستانتین) شناختند. امپراتور رومی برای آماده کردن شهر دست به گسترش آن زد و یکی از مهمترین تعهداتش در این راستا، بازسازی و به روز کردن هیپودروم بود. به گفته مورخین، هیپودروم ساخته کنستانتین با حدود ۴۵۰ متر طول و ۱۳۰ متر عرض، ظرفیت کافی برای ۱۰۰ هزار تماشاگر را داشته است.</p>\r\n\r\n<p dir="RTL" style="text-align:justify">برنامه هایی که در هیپودروم برگزار می شدند، تنها یک مسابقه ورزشی صرف نبودند. بلکه به عنوان موقعیتی کمیاب و ویژه دانسته می شدند که در آن مردم می توانستند همراه با امپراتور در یک برنامه حضور یابند و او را ببینند! این میدان U شکل، به طوری ساخته شده بوده که اتاق مخصوص امپراتور (کاتیسما) در انتهای شرقی آن قرار داشته است. امپراتور و خانواده سلطنتی تنها کسانی بودند که می توانستند با عبور از گذرگاه مخصوص از کاخ بزرگ خود مستقیم به میدان هیپودروم آمده و در اتاق مخصوص خود مستقر شوند.</p>\r\n\r\n<p dir="RTL" style="text-align:justify">در طول دوران امپراتوری بیزانس، میدان هیپودروم مرکز زندگی اجتماعی شهر بود. هزاران تن از مردم و مقامات امپراتوری بیزانس، مات تماشای مسابقه اسب دوانی و ارابه رانی بودند که میان چهار گروه برگزار می شد. هر کدام از این چهار گروه، از سوی یکی از احزاب سنای روم یا بیزانس حمایت می شدند. هر کدام از این احزاب، علاوه بر ویژگی های مذهبی و سیاسی، رنگ خاص خود را نیز داشتند. رقابت ارابه رانان سبز، آبی، سرخ، و سفیدپوش در هیپودروم، به عنوان نشانه ای از رقابت میان این گروه های سیاسی نیز دانسته می شد. این رقابت گاه بالا می گرفت و به شورش یا جنگ در شهر تبدیل می شد. در سال 532 میلادی، در یکی از این شورشها که میان دو گروه آبی و سبز درگرفت، 30هزار تن کشته شدند و کلیسای هاجیاصوفیای دوم به آتش کشیده شد. پس از این شورش، هاجیاصوفیای کوچک در کنار کلیسای اصلی هاجیا صوفیا بازسازی شد که تا امروز در استانبول موجود است.</p>\r\n\r\n<p dir="RTL" style="text-align:justify">.&nbsp;</p>\r\n\r\n<p dir="RTL" style="text-align:right">&nbsp;</p>',
  locations: 2,
  image: '/media/blog/2022/09/24/37e9ead3-4177-52d5-8f81-6b1c4e9143df.jpg',
  active: true,
  slug: 'میدان-هیپودروم-استانبول',
  Tags: [],
  created_on: '2022-09-24T13:56:36.060031+03:30',
};

export default function BlogsDetailsMain() {
  const convertToEnglishNumber = useEnglishNumbers();
  const date = new Date(blog.created_on);
  // console.log(
  //   '🚀 ~ BlogsDetailsMain ~ date:',
  //   date.toLocaleDateString('fa-IR')
  // );
  const formatter = new Intl.DateTimeFormat('fa-IR', {
    year: 'numeric',
    month: 'long',
    day: '2-digit',
  });
  const persianDate = convertToEnglishNumber(formatter.format(date));

  return (
    <div
      style={{
        // border: '1px solid red',
        width: '100%',
        overflow: 'hidden',
      }}
    >
      <BlogsDetailsMainImage image={blog.image} title={blog.title} />
      <div style={{ marginTop: '16px', fontSize: '14px', textAlign: 'left' }}>
        {persianDate}
      </div>
      <div
        dangerouslySetInnerHTML={{ __html: blog.description }}
        style={{ marginTop: '24px', fontSize: '14px', lineHeight: '28px' }}
      ></div>
      <BlogsDetailsMainNavigation />
      <BlogsDetailsMainComments />

      {/* <div
        style={{
          height: '200px',
          display: 'flex',
          border: '1px solid green',
          justifyContent: 'space-between',
        }}
      >
        <div
          style={{
            width: '300px',
            height: '100%',
            backgroundColor: 'red',
          }}
        ></div>
        <div
          style={{
            width: '2000px',
            height: '100%',
            backgroundColor: 'blue',
            flexGrow: '5',
            flexShrink: '5',
          }}
        ></div>
      </div> */}
    </div>
  );
}
