export const accordiondata = [
  {
    question: "مقدار بار مجاز هواپیما چقدر است؟    ",
    answer:
      "در پرواز های خارجی وابسته به ایرلاین انتخابی از 20 تا 30 کیلوگرم در اکونومی کلاس امکان حمل بار وجود دارد؛ البته در برخی از ایرلاین های بین المللی امکان حمل دو بسته 23 کیلوگرمی مقدور است. در پرواز های داخلی اما مقدار بار مجاز 15 الی 20 کیلوگرم است. بیش از این مقدار مشمول بر پرداخت هزینه بیشتر و قوانین اضافه بار است. البته میزان بار مجاز به کلاس پرواز شما نیز مرتبط بوده و با انتخاب کلاس های بیزنس و یا فرست کلاس امکان حمل بار بیشتری خواهید داشت.",
  },
  {
    question: "مقدار بار مجاز هواپیما چقدر است؟    ",
    answer:
      "در پرواز های خارجی وابسته به ایرلاین انتخابی از 20 تا 30 کیلوگرم در اکونومی کلاس امکان حمل بار وجود دارد؛ البته در برخی از ایرلاین های بین المللی امکان حمل دو بسته 23 کیلوگرمی مقدور است. در پرواز های داخلی اما مقدار بار مجاز 15 الی 20 کیلوگرم است. بیش از این مقدار مشمول بر پرداخت هزینه بیشتر و قوانین اضافه بار است. البته میزان بار مجاز به کلاس پرواز شما نیز مرتبط بوده و با انتخاب کلاس های بیزنس و یا فرست کلاس امکان حمل بار بیشتری خواهید داشت.",
  },
  {
    question: "مقدار بار مجاز هواپیما چقدر است؟    ",
    answer:
      "در پرواز های خارجی وابسته به ایرلاین انتخابی از 20 تا 30 کیلوگرم در اکونومی کلاس امکان حمل بار وجود دارد؛ البته در برخی از ایرلاین های بین المللی امکان حمل دو بسته 23 کیلوگرمی مقدور است. در پرواز های داخلی اما مقدار بار مجاز 15 الی 20 کیلوگرم است. بیش از این مقدار مشمول بر پرداخت هزینه بیشتر و قوانین اضافه بار است. البته میزان بار مجاز به کلاس پرواز شما نیز مرتبط بوده و با انتخاب کلاس های بیزنس و یا فرست کلاس امکان حمل بار بیشتری خواهید داشت.",
  },
  {
    question: "مقدار بار مجاز هواپیما چقدر است؟    ",
    answer:
      "در پرواز های خارجی وابسته به ایرلاین انتخابی از 20 تا 30 کیلوگرم در اکونومی کلاس امکان حمل بار وجود دارد؛ البته در برخی از ایرلاین های بین المللی امکان حمل دو بسته 23 کیلوگرمی مقدور است. در پرواز های داخلی اما مقدار بار مجاز 15 الی 20 کیلوگرم است. بیش از این مقدار مشمول بر پرداخت هزینه بیشتر و قوانین اضافه بار است. البته میزان بار مجاز به کلاس پرواز شما نیز مرتبط بوده و با انتخاب کلاس های بیزنس و یا فرست کلاس امکان حمل بار بیشتری خواهید داشت.",
  },
  {
    question: "مقدار بار مجاز هواپیما چقدر است؟    ",
    answer:
      "در پرواز های خارجی وابسته به ایرلاین انتخابی از 20 تا 30 کیلوگرم در اکونومی کلاس امکان حمل بار وجود دارد؛ البته در برخی از ایرلاین های بین المللی امکان حمل دو بسته 23 کیلوگرمی مقدور است. در پرواز های داخلی اما مقدار بار مجاز 15 الی 20 کیلوگرم است. بیش از این مقدار مشمول بر پرداخت هزینه بیشتر و قوانین اضافه بار است. البته میزان بار مجاز به کلاس پرواز شما نیز مرتبط بوده و با انتخاب کلاس های بیزنس و یا فرست کلاس امکان حمل بار بیشتری خواهید داشت.",
  },
];
